[
    {
        "title": "weather-dashboard",
        "description": "This weather dashboard can display the weather for today and include a 5 day forecast. The weather card will display the city name, weather, temperature, humidity, and wind speed. To use it the user can input a city name into the search bar and select search. the weather will display with the forecast under it. The input will save to local storeage to reference in the drop down. The user can also select a button to display the weather for that city without any input.",
        "link": "https://milkytea6.github.io/weather-dashboard/",
        "repository": "https://github.com/Milkytea6/weather-dashboard"
    },
    {
        "title": "netflix-movie-picker",
        "description": "Welcome to Netflix Movie Picker! This web application aims to simplify the daunting task of choosing a movie to watch on Netflix. With an extensive database of movies across various genres, Netflix Movie Picker provides you with a curated list of recommendations based on your selected preferences.",
        "link": "https://milkytea6.github.io/netflix-movie-picker/",
        "repository": "https://github.com/Milkytea6/netflix-movie-picker"
    },
    {
        "title": "e-commerce-service",
        "description": "An application where the user can use routes to get, post, update, and delete data on products, categories, and tags.",
        "link": "https://drive.google.com/file/d/1p_TE-ymuKgJG7OcIsmRoiJaRx0JHk-Ao/view?usp=sharing",
        "repository": "https://github.com/Milkytea6/e-commerce-service"

    },
    {
        "title": "empolyee-payroll-tracker",
        "description": "I was given starter code of an non-functioning employee payroll tracker. I added javascript to it in order for the 'Add Employees' button to work. It also averages up all the salaries and picks a random employee and logs it in the console.",
        "link": "https://milkytea6.github.io/empolyee-payroll-tracker/",
        "repository": "https://github.com/Milkytea6/empolyee-payroll-tracker"
    }
]